Repository: lucas861223/MiitsuColorController
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_tw

# Common_ActivateButtonDescription
source: Activate Twitch chat control. Need to turn off testings first.
zh_tw: 啟用Twitch聊天室控制，需先關閉運行中的測試

# Common_ArtmeshNameListviewDescription
source: Select the artmeshes to be tinted by checking the boxes. During testing, the changes will automatically apply without needing to save first. Due to a bug in Winui 3 (Github issue #7230), scrolling down the list will crash the app. Please use the filter function instead.
zh_tw: 勾選欲改變顏色的部件(artmesh) 測試時更改設定可馬上套用，不需要另外儲存 因Winui 3問題(issue #7230)，滾動列表時會造成程式閃退，請善用搜尋功能

# Common_AutoTestButtonDescription
source: Automatic Testing Need to deactivate Twitch chat control first. The app will automatically choose colors and tint the selected artmeshes. Changes made during testing will automatically be applied without the need to save. This will show the effect of duration, interpolaton and color range setting.
zh_tw: 自動變色測試\n需先停用聊天室控制 程式將把選取的部件以範圍內的顏色染色 啟用時更改設定可馬上套用，不需要另外儲存\n可以藉此機會看設定的速度、漸變、顏色範圍等是否滿意

# Common_BlueDescription
source: Twitch chat keyword for adding blue in target color.
zh_tw: 增加藍色元素的聊天室關鍵詞

# Common_ColorPickerCanvasDescription
source: H-S Chart X-axis corresponds to Hue in HSV, from left to right is 0 to 360. The Y-axis corresponds to saturation in HSV, from top to bottom is 0 to 100. During Manual Testing mode, you can choose a new color by clicking on this panel.
zh_tw: H-S色表 x軸為色調(hue)，從左至右由0到360，y軸為飽和度(saturation)，從上至下由0到100 手動選色測試時可以在此選擇顏色

# Common_RectColorDescription
source: V Chart Y-axis corresponds to Value in HSV, from top to bottom is 100 to 0. Choose the hue and saturation by clicking on the color picker on the right. During Manual Testing mode, you can choose a new color by clicking on this panel.
zh_tw: V色表 y軸為明亮度(value)，從上至下由100到0 點擊右方色表即可挑選色調和飽和度 手動選色測試時可以在此選擇顏色

# Common_DefaultDescription
source: Remember to save the setting so the App can automatically load it for you next time. If you load a new model in Vtube studio, the App will need to be refreshed to fetch its information. If the feature is activated, you need to save to apply changes.
zh_tw: 設定結束後存檔，即可在下一次開啟時自動讀取 更換模組後需要先刷新才會讀取新模組信息 啟用聊天室控制後更改設定需要存檔才會套用

# Common_DurationDescription
source: Duration The amount of time it takes to change from Color A to Color B. The shorter the duration, the faster it goes through the changes, and the lower the performance is. Use the testing function to see what your computer can handle.
zh_tw: 時長 由顏色A變成顏色B時應花費的時間 數字越高，變色越慢，對程式和vtube studio的負擔越輕 建議善用測試功能來測試可以承受的數量

# Common_FilterDescription
source: Filter the artmeshes and tags.
zh_tw: 篩選部件和標籤

# Common_GreenDescription
source: Twitch chat keyword for adding green in target color.
zh_tw: 增加綠色元素的聊天室關鍵詞

# Common_InterpolationDescription
source: Interpolation How many colors will the program go through from Color A to Color B. The higher the number, the smoother the transition, and the lower the performance is. Ex. When transitioning from black (0, 0, 0) to red (255, 0, 0), how many in-between colors such as (25, 0, 0), (50, 0, 0) will the program go through. Use the testing function to see what your computer can handle.
zh_tw: 漸變次數 由顏色A變成顏色B時中間過渡顏色的數量 數量越高，顏色變化越順，對程式和Vtube Studio的負擔越重 例:由黑色(0,0,0)變成紅色(255,0,0)時，中間應有多少如(25,0,0)、(50,0,0)等過渡色 建議善用測試功能來測試可以承受的數量

# Common_ManualTestButtonDescription
source: Manual Testing Need to deactivate Twitch chat control first. The app will tint the selected artmeshes with the color selected on the color picker. Changes made during testing will automatically be applied without the need to save. User can click on the color picker on the bottom right to select a color to tint. This will show the effect of duration and interpolation setting, and test how the artmeshes will look with certain color.
zh_tw: 手動選色測試 需先停用聊天室控制 程式將把選取的部件染上右下角色表選擇的顏色 啟用時更改設定可馬上套用，不需要另外儲存 使用者可以點擊右下角的色表來指定要變成的顏色 可以藉此機會看設定的速度、漸變等是否滿意，以及測試理想的顏色範圍

# Common_MessageCountDescription
source: Reference Message Number The number of messages to take the average of color distribution from.
zh_tw: 參考訊息數量 要參考多少訊息的顏色比例來決定目標顏色

# Common_MessageHandlingMethodDescription
source: Color Handling Method Determine what to do with a new color when the current color has not yet been completely processed yet. Cumulative- Stop the current color changing process, and change towards the new color. Queued- Finish the current color changing process, then process the next.
zh_tw: 變色方針 設定此功能在當前顏色還未完全變化時該如何處理新的變色指令 累積變色- 中斷當前指令，並將目標替換成新顏色 排程變色- 將當前目標變色完成，再處理下一個顏色

# Common_RangesDescription
source: Ranges of color to tint.
zh_tw: 可接受的顏色範圍 上方色表將會反應範圍更變

# Common_RedDescription
source: Twitch chat keyword for adding red in target color.
zh_tw: 增加紅色元素的聊天室關鍵詞

# Common_RefreshButtonDescription
source: Load the current model from Vtube Studio, as well as the corresponding config. This can also be used to discard unsaved changes and revert to the last saved config.
zh_tw: 讀取新的模型，並讀取相應設定 或是捨棄修改，恢復儲存的設定

# Common_SaveButtonDescription
source: Save the current config, and apply if the feature is activated.
zh_tw: 儲存現在的設定，並套用至正在運行的功能上

# Common_TagListViewDescription
source: Select the tag of the artmeshes to be tinted by checking the boxes. During testing, the changes will automatically apply without needing to save first. Due to a bug in Winui 3 (Github issue #7230), scrolling down the list will crash the app. Please use the filter function instead.
zh_tw: 勾選欲改變顏色的標籤(Tag) 測試時更改設定可馬上套用，不需要另外儲存 因Winui 3問題(issue #7230)，滾動列表時會造成程式閃退，請善用搜尋功能

# ArtmeshTintingFeature_ArtmeshListView.Header
source: Artmesh
zh_tw: 部件

# ArtmeshTintingFeature_FilterTextBox.PlaceholderText
source: Search for artmesh and tag
zh_tw: 搜尋部件和標籤...

# ArtmeshTintingFeature_InterpolationUnit.Text
source: times
zh_tw: 次

# ArtmeshTintingFeature_Maximum.Text
source: Maximum:
zh_tw: 最大：

# ArtmeshTintingFeature_MessageCountPartOne.Text
source: Calculate the keyword proportion from past
zh_tw: 以前

# ArtmeshTintingFeature_MessageCountPartTwo.Text
source: messages to determine the color.
zh_tw: 條訊息中的比例平均值做為選色方針

# ArtmeshTintingFeature_Milliseconed.Text
source: millisecond
zh_tw: 毫秒

# ArtmeshTintingFeature_Minimum.Text
source: Minimum:
zh_tw: 最小：

# ArtmeshTintingFeature_NotConnectedWarning.Text
source: This feature is only avaliable when connected to Vtube Studio.
zh_tw: 此功能只在有連結到Vtube Studio時才能使用

# ArtmeshTintingFeature_Saturation.Text
source: Saturation
zh_tw: 飽和度

# ArtmeshTintingFeature_SaturationRange.Text
source: Saturation Range (0~100)
zh_tw: 可變的飽和度範圍 (0~100)

# ArtmeshTintingFeature_TagListView.Header
source: Tag
zh_tw: 標籤

# ArtmeshTintingFeature_TwitchChatControl.Text
source: Twitch Chat Control
zh_tw: 聊天室控制：

# ArtmeshTintingFeature_Value.Text
source: Value
zh_tw: 明亮度

# ArtmeshTintingFeature_ValueRange.Text
source: Value Range (0~100)
zh_tw: 可變的明亮度範圍 (0~100)

# ArtmeshTinting_Blue.Text
source: Blue:
zh_tw: 藍色：

# ArtmeshTinting_Cumulative.Text
source: Replace
zh_tw: 累積變色

# ArtmeshTinting_CurrentModel.Text
source: Current Model:
zh_tw: 當前模型：

# ArtmeshTinting_CurrentModelID.Text
source: Model ID:
zh_tw: 模型ID：

# ArtmeshTinting_Duration.Text
source: Duration:
zh_tw: 時長：

# ArtmeshTinting_Green.Text
source: Green Keyword:
zh_tw: 綠色：

# ArtmeshTinting_Interpolation.Text
source: Interpolation:
zh_tw: 漸變次數：

# ArtmeshTinting_MessageCount.Text
source: Number of message to reference:
zh_tw: 參考訊息數量：

# ArtmeshTinting_MessageHandlingMethod.Text
source: Color Processing Mode
zh_tw: 變色方針：

# ArtmeshTinting_NotConnectedWarning.Text
source: Not Connected to Vtube Studio
zh_tw: 未連結Vtube Studio

# ArtmeshTinting_Queued.Text
source: Queued
zh_tw: 排程變色

# ArtmeshTinting_Red.Text
source: Red Keyword:
zh_tw: 紅色：

# ArtmeshTinting_SaturationRange.Text
source: Saturation Range
zh_tw: 飽和度範圍：

# ArtmeshTinting_ValueRange.Text
source: Value range:
zh_tw: 明亮度範圍：

# Connection_AutoReconnetButton.Content
source: Auto Reconnect
zh_tw: 斷線後自動重試

# Connection_ConnectOnStartUpButton.Content
source: Auto Connect On Startup
zh_tw: 啟動時自動連結

# Connection_TwitchAccountTextBox.PlaceholderText
source: Twitch Username.
zh_tw: Twitch用戶名稱

# Connection_TwitchAuthTokenTextBox.PlaceholderText
source: Use the link to the left to generate an access token, then paste it here.
zh_tw: 用左邊的網站生產一個Access token，然後貼上來

# Connection_TwitchAccount.Text
source: Username:
zh_tw: 帳號：

# Connection_VTSTextBox.PlaceholderText
source: In setting, need to enable API first.
zh_tw: 在設定裡,需先開啟API

# Connection_VTSWebSocketUri.Text
source: WebSocket URI
zh_tw: API地址：

# Overview_ConnectButton.Content
source: Connect
zh_tw: 連結

# ArtmeshTinting_VerbalCumulative
source: Replace
zh_tw: 累積變色

# ArtmeshTinting_VerbalQueued
source: Queued
zh_tw: 排程變色

# Common_Activate
source: Activate
zh_tw: 啟用

# Common_Connecting
source: Connecting...
zh_tw: 連結中...

# Common_Deactivate
source: Deactivate
zh_tw: 停用

# Common_NotConnected
source: Not Connected
zh_tw: 未連結

# Common_SuccessfullyConnected
source: Successfully Connected
zh_tw: 連結成功

# Common_TwitchAuthTokenProblem
source: Login Failed- Did you follow the instruction to get your Access Token? Or try freshing your Access Token (scroll down).
zh_tw: 登入失敗- Access Token有照著指示給嗎? 試著Refresh你的Token(往下滑)

# Common_TwitchCannotConnect
source: Connection Failed- Are you connected to the internet?
zh_tw: 連結失敗- 網路有開嗎?

# Common_TwitchLoginFailed
source: Login Failed- Is your username correct?
zh_tw: 連結失敗- 帳號有打對嗎?

# Common_VTSAuthenticationFailed
source: Authentication Failed
zh_tw: 授權失敗

# Common_VTSFailedConnection
source: Connection Failed- Can't find Vtube Studio Is it opened? Is API enabled? Are the link and port correct? Try replacing 0.0.0.0 with localhost
zh_tw: 連結失敗- 找不到Vtube Studio 有開Vtube Studio嗎? 有開啟API嗎? 網址和埠號有打對嗎? 還是不行的話，試試看把0.0.0.0替換成localhost

# Common_VTSLostConnection
source: Lost connection with VTube Studio
zh_tw: 失去與VTube Studio的連結

# Common_WaitingForAuthentication
source: Waiting for authentication...
zh_tw: 等待授權...
